lpc55/lpc55-pac/svd/SDK-2.6.2/LPC55S69_cm33_core0.fixed.xml
        <register>
          <name>WAKEIOCAUSE</name>
          <description>Allows to identify the Wake-up I/O source from Deep Power Down mode</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>WAKEUP0</name>
              <description>Allows to identify Wake up I/O 0 as the wake-up source from Deep Power Down mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOEVENT</name>
                  <description>Last wake up from Deep Power down mode was NOT triggred by wake up I/O 0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVENT</name>
                  <description>Last wake up from Deep Power down mode was triggred by wake up I/O 0.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WAKEUP1</name>
              <description>Allows to identify Wake up I/O 1 as the wake-up source from Deep Power Down mode.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOEVENT</name>
                  <description>Last wake up from Deep Power down mode was NOT triggred by wake up I/O 1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVENT</name>
                  <description>Last wake up from Deep Power down mode was triggred by wake up I/O 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WAKEUP2</name>
              <description>Allows to identify Wake up I/O 2 as the wake-up source from Deep Power Down mode.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOEVENT</name>
                  <description>Last wake up from Deep Power down mode was NOT triggred by wake up I/O 2.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVENT</name>
                  <description>Last wake up from Deep Power down mode was triggred by wake up I/O 2.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WAKEUP3</name>
              <description>Allows to identify Wake up I/O 3 as the wake-up source from Deep Power Down mode.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOEVENT</name>
                  <description>Last wake up from Deep Power down mode was NOT triggred by wake up I/O 3.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVENT</name>
                  <description>Last wake up from Deep Power down mode was triggred by wake up I/O 3.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUSCLK</name>
          <description>FRO and XTAL status register [Reset by: PoR, Brown Out Detectors Reset]</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x6</resetValue>
          <resetMask>0x7</resetMask>
          <fields>
            <field>
              <name>XTAL32KOK</name>
              <description>XTAL oscillator 32 K OK signal.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FRO1MCLKVALID</name>
              <description>FRO 1 MHz CCO voltage detector output.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>XTAL32KOSCFAILURE</name>
              <description>XTAL32 KHZ oscillator oscillation failure detection indicator.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOFAIL</name>
                  <description>No oscillation failure has been detetced since the last time this bit has been cleared..</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FAILURE</name>
                  <description>At least one oscillation failure has been detetced since the last time this bit has been cleared..</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AOREG1</name>
          <description>General purpose always on domain data storage [Reset by: PoR, Brown Out Detectors Reset]</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA31_0</name>
              <description>General purpose always on domain data storage.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCOSC32K</name>
          <description>RTC 1 KHZ and 1 Hz clocks source control register [Reset by: PoR, Brown Out Detectors Reset]</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3FF0008</resetValue>
          <resetMask>0xC7FF800F</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>Select the 32K oscillator to be used in Deep Power Down Mode for the RTC (either XTAL32KHz or FRO32KHz) .</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FRO32K</name>
                  <description>FRO 32 KHz.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTAL32K</name>
                  <description>XTAL 32KHz.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLK1KHZDIV</name>
              <description>Actual division ratio is : 28 + CLK1KHZDIV.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK1KHZDIVUPDATEREQ</name>
              <description>RTC 1KHz clock Divider status flag.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK1HZDIV</name>
              <description>Actual division ratio is : 31744 + CLK1HZDIV.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK1HZDIVHALT</name>
              <description>Halts the divider counter.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK1HZDIVUPDATEREQ</name>
              <description>RTC 1Hz Divider status flag.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OSTIMER</name>
          <description>OS Timer control register [Reset by: PoR, Brown Out Detectors Reset]</description>
          <addressOffset>0x9C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x8</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>SOFTRESET</name>
              <description>Active high reset.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLOCKENABLE</name>
              <description>Enable OSTIMER 32 KHz clock.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DPDWAKEUPENABLE</name>
              <description>Wake up enable in Deep Power Down mode (To be used in Enable Deep Power Down mode).</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OSC32KPD</name>
              <description>Oscilator 32KHz (either FRO32KHz or XTAL32KHz according to RTCOSC32K.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
